title: TamperedChef Recipe Application Execution
id: 03bd60c7-0c92-4d1c-8bf7-9e34555504c4
status: experimental
description: Detects execution of known recipe-themed application names associated
  with the original TamperedChef campaign.
references:
- https://blog.lukeacha.com/2025/06/suspicious-recipe-app.html
- https://blog.lukeacha.com/2025/08/pdf-editor-analysis.html
author: Luke Acha
date: '2026-07-22'
tags:
- attack.execution
- attack.t1204.002
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith:
    - \RecipeLister.exe
    - \Forks.exe
    - \lookupkitchen.exe
  condition: selection
falsepositives:
- A user intentionally running an application with one of these exact names
level: medium
